of_phase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       292000;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       294000;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       296000;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       301000;
    }
    frontAndBack
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       306000;
    }
)

// ************************************************************************* //
